# DividedPathLayoutStepFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures..::..DividedPathLayoutStepFailed Property
BuiltInFailures..::..DividedPathFailures Class See Also
---
Layout algorithm failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedPathLayoutStepFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedPathLayoutStepFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedPathLayoutStepFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedPathFailures Class
Autodesk.Revit.DB Namespace